/*!
 * Distpicker v1.0.4
 * https://github.com/fengyuanchen/distpicker
 *
 * Copyright (c) 2014-2016 Fengyuan Chen
 * Released under the MIT license
 *
 * Date: 2016-06-01T15:05:52.606Z
 */

(function (factory) {
  if (typeof define === 'function' && define.amd) {
    // AMD. Register as anonymous module.
    define('ChineseDistricts', [], factory);
  } else {
    // Browser globals.
    factory();
  }
})(function () {

  var ChineseDistricts = {
    86: {
      320100: '南京',
      320500: '苏州',
      320300: '徐州',
      320400: '常州',
      320200: '无锡',
      320800: '淮安',
      320900: '盐城',
      320600: '南通',
      321100: '镇江',
    },
    320100: {
      1: '六合区',
      2:'高淳区',
      3:'溧水区',
      4:'江宁区',
      5:'雨花台区',
      6:'浦口区',
      7:'栖霞区',
      8:'鼓楼区',
      9:'建邺区',
      10:'秦淮区',
      11:'玄武区',
    },
    320500: {
      12: '张家港市',
      13:'常熟市',
      14:'太仓市',
      15:'相城区',
      16:'昆山市',
      17:'姑苏区',
      18:'虎丘区',
      19:'吴中区',
      20:'吴江区',
    },
    320300: {
      41:'丰县',
      42:'沛县',
      43:'铜山区',
      44:'鼓楼区',
      45:'贾汪区',
      46:'泉山区',
      47:'云龙区',
      48:'邳州市',
      49:'睢宁县',
      50:'新沂市',
    },
    320400:{
      28:'新北区',
      29:'钟楼区',
      30:'天宁区',
      31:'武进区',
      32:'金坛区',
      33:'溧阳市',
    },
    320200:{
      21:'江阴市',
      22:'惠山区',
      23:'锡山区',
      24:'梁溪区',
      25:'新吴区',
      26:'滨湖区',
      27:'宜兴市',
    },
    320800:{
      34:'涟水县',
      35:'淮阴区',
      36:'清江浦区',
      37:'淮安区',
      38:'洪泽区',
      39:'金湖县',
      40:'盱眙县',
    },
    320900:{
      58:'响水县',
      59:'滨海县',
      60:'阜宁县',
      61:'射阳县',
      62:'建湖县',
      63:'亭湖区',
      64:'盐都区',
      65:'大丰区',
      66:'东台市',
    },
    320600:{
      51:'海安市',
      52:'如东县',
      53:'如皋市',
      54:'通州市',
      55:'崇川区',
      56:'海门区',
      57:'启东市',
    },
    321100:{
      67:'句容市',
      68:'丹徒区',
      69:'润州区',
      70:'丹阳市',
      71:'京口区',
      72:'扬中市',
    },

  };

  if (typeof window !== 'undefined') {
    window.ChineseDistricts = ChineseDistricts;
  }

  return ChineseDistricts;

});
